# IsEqual Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PointCloudOverrides..::..IsEqual Method
PointCloudOverrides Class See Also
---
Check if the contents of two overrides are equal.
**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool IsEqual(
	PointCloudOverrides other
)
```

Visual Basic
---
```text
Public Function IsEqual ( _
	other As PointCloudOverrides _
) As Boolean
```

Visual C++
---
```text
public:
bool IsEqual(
	PointCloudOverrides^ other
)
```

# ### Parameters
other
    Type: Autodesk.Revit.DB.PointClouds..::..PointCloudOverrides The overrides to be compared.
# ### Return Value
True for equal, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
PointCloudOverrides Class
Autodesk.Revit.DB.PointClouds Namespace